//#define _CRT_SECURE_NO_WARNINGS 1
//
//#include<stdio.h>
//
//extern int 球1 = 0, 球2 = 0, 球3 = 0, 水泵1 = 0, 水泵2 = 0;
//extern int 超高报警 = 0, 启水泵1标志 = 0, 启水泵2标志 = 0, 浮球状态异常 = 0,
//综合故障1 = 0, 综合故障2 = 0;
//extern int 手动位 = 0, 复位 = 0, 自动位 = 0;
//
//int main()
//{
//
//	int start_up_logic();
//	int start_up_program();
//
//	printf("请选择模拟/实时（0/1）控制\n");
//	scanf("%d", &自动位);
//
//	if (自动位 == 0)
//	{
//		printf("打开水泵控制模拟\n***************\n");
//
//
//		printf("选择模拟监测水位\n***************\n");
//		printf("低水位="); scanf("%d", &球1);
//		printf("\n中水位="); scanf("%d", &球2);
//		printf("\n高水位="); scanf("%d", &球3);
//
//		printf("\n\n正在输出结果...\n\n");
//		//for (; 1;)
//		//{
//
//		start_up_logic();
//		start_up_program();
//
//		printf("超高报警=%d\n", 超高报警);
//		printf("浮球状态异常=%d\n", 浮球状态异常);
//		printf("综合故障1=%d\n", 综合故障1);
//		printf("综合故障2=%d\n", 综合故障2);
//
//		//}
//	}
//	else
//	{
//		printf("实时模式已开启\n");
//
//		for (; 1;)//
//		{
//			printf("*********************************************\n正在接收水位信息...\n");
//			printf("低水位="); scanf("%d", &球1);
//			printf("\n中水位="); scanf("%d", &球2);
//			printf("\n高水位="); scanf("%d", &球3);
//
//			start_up_logic();
//			start_up_program();
//
//			printf("超高报警=%d\n", 超高报警);
//			printf("浮球状态异常=%d\n", 浮球状态异常);
//			printf("综合故障1=%d\n", 综合故障1);
//			printf("综合故障2=%d\n", 综合故障2);
//			printf("*********************************************\n");
//		}
//	}
//	return 0;
//}
//
///*--------水泵运行---------*/
//int start_up_program()//水泵运行模块
//{
//	if (自动位 == 1 && 综合故障1 == 0 && 启水泵1标志 == 1)
//	{
//		水泵1 = 1;
//		printf("水泵1=%d\n", 水泵1);
//	}
//	else
//	{
//		水泵1 = 0;
//		printf("水泵1=%d\n", 水泵1);
//	}
//	if (自动位 == 1 && 综合故障2 == 0 && 启水泵2标志 == 1)
//	{
//		水泵2 = 1;
//		printf("水泵2=%d\n", 水泵2);
//	}
//	else
//	{
//		水泵2 = 0;
//		printf("水泵2=%d\n", 水泵2);
//	}
//}
//
///*----------水泵启动逻辑----------*/
//int start_up_logic()//水泵启动逻辑模块
//{
//	if (球1 == 0 && 球2 == 0 && 球3 == 0)
//	{
//		超高报警 = 0;
//		启水泵1标志 = 0;
//		启水泵2标志 = 0;
//	}//水池没水信息清零，之前的浮球状态异常不清除，等待检修人员过来处理后用手动位清除。
//	if (球1 == 0 && 球2 == 0 && 球3 == 1)
//	{
//		超高报警 = 1;
//		浮球状态异常 = 1;
//		启水泵1标志 = 1;
//		启水泵2标志 = 1;
//	}//即使浮球异常也要起两台水泵。可能浮球坏了，需要报警。
//	if (球1 == 0 && 球2 == 1 && 球3 == 1)
//	{
//		超高报警 = 1;
//		浮球状态异常 = 1;
//		启水泵1标志 = 1;
//		启水泵2标志 = 1;
//	}//即使浮球异常也要起水泵。可能浮球坏了，但要报警并起两台泵。
//	if (球1 == 1 && 球2 == 0 && 球3 == 1)
//	{
//		超高报警 = 1;
//		浮球状态异常 = 1;
//		启水泵1标志 = 1;
//		启水泵2标志 = 1;
//	}//即使启泵浮球异常也要起水泵。可能浮球坏了，但要报警并起超高。
//	if (球1 == 0 && 球2 == 1 && 球3 == 0)
//	{
//		浮球状态异常 = 1;
//		启水泵1标志 = 1;
//	}//即使浮球异常也要起水泵。可能浮球坏了，需要报警。
//	if (球1 == 1 && 球2 == 1 && 球3 == 0)
//	{
//		启水泵1标志 = 1;
//	}//水满了，启泵浮球运作
//	if (球1 == 1 && 球2 == 1 && 球3 == 1)
//	{
//		超高报警 = 1;
//		启水泵1标志 = 1;
//		启水泵2标志 = 1;
//	}//水位满起来超高了，报警并起超高。两台泵都要同时启动
//
//	if (球1 == 1 && 球2 == 0 && 球3 == 0)
//	{
//		启水泵1标志 = 0;
//		启水泵2标志 = 0;
//	}//低水位水泵不启动
//
//	if (手动位 == 1 && 复位 == 1)
//	{
//		超高报警 = 0;
//		浮球状态异常 = 0;
//		启水泵1标志 = 0;
//		启水泵2标志 = 0;
//	}//故障报警打手动位可复位并清除报警
//}
///*-------故障判断------*/
////int  Integrative_Fault()//综合故障模块（略）
////{
////	if (过载保护1 == 1 || 电压保护1 == 1 || 漏水保护1 == 1 || 缺相保护1 == 1)
////		综合故障1 = 1;
////}

#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

char 球1 = 0, 球2 = 0, 球3 = 0, 水泵1 = 0, 水泵2 = 0;
char 超高报警 = 0, 启水泵1标志 = 0, 启水泵2标志 = 0, 浮球状态异常 = 0,
综合故障1 = 0, 综合故障2 = 0;
char 手动位 = 0, 复位 = 0, 自动位 = 0;

void main()
{

	char start_up_logic();
	char start_up_program();

	printf("请选择模拟/实时（0/1）控制\n");
	scanf("%d", &自动位);

	if (自动位 == 0)
	{
		printf("打开水泵控制模拟\n***************\n");


		printf("选择模拟监测水位\n***************\n");
		printf("低水位=");
		scanf("%d", &球1);
		printf("\n中水位=");
		scanf("%d", &球2);
		printf("\n高水位=");
		scanf("%d", &球3);

		printf("\n\n正在输出结果...\n\n");
		//for (; 1;)
		//{

		start_up_logic();
		start_up_program();

		printf("超高报警=%d\n", 超高报警);
		printf("浮球状态异常=%d\n", 浮球状态异常);
		printf("综合故障1=%d\n", 综合故障1);
		printf("综合故障2=%d\n", 综合故障2);

		//}
	}
	else
	{
		printf("实时模式已开启\n");

		for (; 1;)//实时循环
		{
			printf("*********************************************\n正在接收水位信息...\n");
			printf("低水位=");
			scanf("%d", &球1);
			printf("\n中水位=");
			scanf("%d", &球2);
			printf("\n高水位=");
			scanf("%d", &球3);
			printf("\n\n正在输出结果...\n\n");

			start_up_logic();
			start_up_program();

			printf("超高报警=%d\n", 超高报警);
			printf("浮球状态异常=%d\n", 浮球状态异常);
			printf("综合故障1=%d\n", 综合故障1);
			printf("综合故障2=%d\n", 综合故障2);
			printf("*********************************************\n");

		}
	}
	return;
}

/*--------水泵运行---------*/
char start_up_program()//水泵运行模块
{
	if (综合故障1 == 0 && 启水泵1标志 == 1)
	{
		水泵1 = 1;
		printf("水泵1=%d\n", 水泵1);
	}
	else
	{
		水泵1 = 0;
		printf("水泵1=%d\n", 水泵1);
	}
	if (综合故障2 == 0 && 启水泵2标志 == 1)
	{
		水泵2 = 1;
		printf("水泵2=%d\n", 水泵2);
	}
	else
	{
		水泵2 = 0;
		printf("水泵2=%d\n", 水泵2);
	}
}

/*----------水泵启动逻辑----------*/
char start_up_logic()//水泵启动逻辑模块
{
	if (球1 == 0 && 球2 == 0 && 球3 == 0)
	{
		超高报警 = 0;
		启水泵1标志 = 0;
		启水泵2标志 = 0;
	}//水池没水信息清零，之前的浮球状态异常不清除，等待检修人员过来处理后用手动位清除。
	if (球1 == 0 && 球2 == 0 && 球3 == 1)
	{
		超高报警 = 1;
		浮球状态异常 = 1;
		启水泵1标志 = 1;
		启水泵2标志 = 1;
	}//即使浮球异常也要起两台水泵。可能浮球坏了，需要报警。
	if (球1 == 0 && 球2 == 1 && 球3 == 1)
	{
		超高报警 = 1;
		浮球状态异常 = 1;
		启水泵1标志 = 1;
		启水泵2标志 = 1;
	}//即使浮球异常也要起水泵。可能浮球坏了，但要报警并起两台泵。
	if (球1 == 1 && 球2 == 0 && 球3 == 1)
	{
		超高报警 = 1;
		浮球状态异常 = 1;
		启水泵1标志 = 1;
		启水泵2标志 = 1;
	}//即使启泵浮球异常也要起水泵。可能浮球坏了，但要报警并起超高。
	if (球1 == 0 && 球2 == 1 && 球3 == 0)
	{
		浮球状态异常 = 1;
		启水泵1标志 = 1;
	}//即使浮球异常也要起水泵。可能浮球坏了，需要报警。
	if (球1 == 1 && 球2 == 1 && 球3 == 0)
	{
		启水泵1标志 = 1;
	}//水满了，启泵浮球运作
	if (球1 == 1 && 球2 == 1 && 球3 == 1)
	{
		超高报警 = 1;
		启水泵1标志 = 1;
		启水泵2标志 = 1;
	}//水位满起来超高了，报警并起超高。两台泵都要同时启动

	if (球1 == 1 && 球2 == 0 && 球3 == 0)
	{
		启水泵1标志 = 0;
		启水泵2标志 = 0;
	}//低水位水泵不启动

	/*if (手动位 == 1 && 复位 == 1)
	{
	超高报警 = 0;
	浮球状态异常 = 0;
	启水泵1标志 = 0;
	启水泵2标志 = 0;
	}//故障报警打手动位可复位并清除报警*/
}

